tutorials/Lagrangian/coalChemistryFoam/simplifiedSiwek/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 5390.5;

boundaryField
{
    top
    {
        type            compressible::epsilonWallFunction;
        value           uniform 5390.5;
    }
    bottom
    {
        type            compressible::epsilonWallFunction;
        value           uniform 5390.5;
    }
    walls
    {
        type            compressible::epsilonWallFunction;
        value           uniform 5390.5;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
