tutorials/Lagrangian/coalChemistryFoam/simplifiedSiwek/constant/enthalpySourceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      enthalpySourceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cellSource      sphereToCell;

volumeType      absolute;

timeStart       0.15;

duration        0.1;

onValue         10000;

offValue        0;

sphereToCellCoeffs
{
    centre          ( 0.125 0.375 0.05 );
    radius          0.005;
}


// ************************************************************************* //
